In [2]:
import pandas as pd

data = [{"name":"hari","city":"bangalore","age":27},
        {"name":"karan","city":"bangalore","age":None},
        {"name":"noi","city":"bangalore","age":20},
        {"name":"poi","city":"bangalore","age":21}
        
        ]
df = pd.DataFrame(data)
df

    name       city   age
0   hari  bangalore  27.0
1  karan  bangalore   NaN
2    noi  bangalore  20.0
3    poi  bangalore  21.0

In [3]:
df.isnull().sum()

name    0
city    0
age     1
dtype: int64

In [4]:
df = df.rename(columns={"name":"userName"})
df

  userName       city   age
0     hari  bangalore  27.0
1    karan  bangalore   NaN
2      noi  bangalore  20.0
3      poi  bangalore  21.0

In [5]:
df["age_fillna"] = df["age"].fillna(df["age"].mean()).astype(int)
df

  userName       city   age  age_fillna
0     hari  bangalore  27.0          27
1    karan  bangalore   NaN          22
2      noi  bangalore  20.0          20
3      poi  bangalore  21.0          21

In [6]:
df["new_age"] = df["age_fillna"].apply(lambda x:x*2)
df

  userName       city   age  age_fillna  new_age
0     hari  bangalore  27.0          27       54
1    karan  bangalore   NaN          22       44
2      noi  bangalore  20.0          20       40
3      poi  bangalore  21.0          21       42

In [7]:
def muliply(x):
    return x*3

df["age_3"] = df["age_fillna"].apply(muliply)
df

  userName       city   age  age_fillna  new_age  age_3
0     hari  bangalore  27.0          27       54     81
1    karan  bangalore   NaN          22       44     66
2      noi  bangalore  20.0          20       40     60
3      poi  bangalore  21.0          21       42     63

In [8]:
df.iloc[1][1]

C:\Users\MHarikrishna\AppData\Local\Temp\ipykernel_13928\1723490747.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[1][1]

'bangalore'

In [9]:
df.at[1,"city"]

'bangalore'

In [10]:
df.loc[1,"city"]="chennai"
df

  userName       city   age  age_fillna  new_age  age_3
0     hari  bangalore  27.0          27       54     81
1    karan    chennai   NaN          22       44     66
2      noi  bangalore  20.0          20       40     60
3      poi  bangalore  21.0          21       42     63

In [11]:
grouped = df.groupby("city")["new_age"].sum()
grouped

city
bangalore    136
chennai       44
Name: new_age, dtype: int64

In [12]:
gruped_agg = df.groupby("city")["new_age"].agg(["sum","mean","count"])
gruped_agg

           sum       mean  count
city
bangalore  136  45.333333      3
chennai     44  44.000000      1

In [13]:
group = df.groupby(["city","userName"])["new_age"].size().reset_index()
group

        city userName  new_age
0  bangalore     hari        1
1  bangalore      noi        1
2  bangalore      poi        1
3    chennai    karan        1

In [14]:
df1 = pd.DataFrame({"key":["A","B","C"], "value1":[1,2,3]})
df2=pd.DataFrame({"key":["A","B","D"], "value2":[4,5,6]})
df1

  key  value1
0   A       1
1   B       2
2   C       3

In [15]:
df2

  key  value2
0   A       4
1   B       5
2   D       6

In [16]:
#merge
pd.merge(df1,df2, on="key", how="inner")

  key  value1  value2
0   A       1       4
1   B       2       5

In [17]:
pd.merge(df1,df2,on="key",how="outer")

  key  value1  value2
0   A     1.0     4.0
1   B     2.0     5.0
2   C     3.0     NaN
3   D     NaN     6.0

In [18]:
pd.merge(df1,df2,on="key",how="left")

  key  value1  value2
0   A       1     4.0
1   B       2     5.0
2   C       3     NaN

In [19]:
pd.merge(df1,df2,on="key",how="right")

  key  value1  value2
0   A     1.0       4
1   B     2.0       5
2   D     NaN       6

In [21]:
df.to_json()

'{"userName":{"0":"hari","1":"karan","2":"noi","3":"poi"},"city":{"0":"bangalore","1":"chennai","2":"bangalore","3":"bangalore"},"age":{"0":27.0,"1":null,"2":20.0,"3":21.0},"age_fillna":{"0":27,"1":22,"2":20,"3":21},"new_age":{"0":54,"1":44,"2":40,"3":42},"age_3":{"0":81,"1":66,"2":60,"3":63}}'

In [22]:
df.to_json(orient="index")

'{"0":{"userName":"hari","city":"bangalore","age":27.0,"age_fillna":27,"new_age":54,"age_3":81},"1":{"userName":"karan","city":"chennai","age":null,"age_fillna":22,"new_age":44,"age_3":66},"2":{"userName":"noi","city":"bangalore","age":20.0,"age_fillna":20,"new_age":40,"age_3":60},"3":{"userName":"poi","city":"bangalore","age":21.0,"age_fillna":21,"new_age":42,"age_3":63}}'

In [24]:
df.to_json(orient="records")

'[{"userName":"hari","city":"bangalore","age":27.0,"age_fillna":27,"new_age":54,"age_3":81},{"userName":"karan","city":"chennai","age":null,"age_fillna":22,"new_age":44,"age_3":66},{"userName":"noi","city":"bangalore","age":20.0,"age_fillna":20,"new_age":40,"age_3":60},{"userName":"poi","city":"bangalore","age":21.0,"age_fillna":21,"new_age":42,"age_3":63}]'

In [25]:
df.to_csv('Test.csv')